export const defaultTests = [
  {
    code: "R",
    question: "말로 표현하는 것보다 직접 행동 하는 것이 좋다.",
  },
  {
    code: "E",
    question: "친구들 사이에서 문제가 생겼을 때 중간에서 조율을 잘한다.",
  },
  {
    code: "I",
    question: "궁금한 것이 생기면 파고들어서 알아내고 싶어 한다.",
  },
  {
    code: "A",
    question: "나의 감수성을 나타낼 수 있는 직업을 갖고 싶다.",
  },
  {
    code: "C",
    question: "일을 빨리 하는 것보다 일을 하는 순서가 더 중요하다.",
  },
  {
    code: "S",
    question: "다른 사람을 도와주는 것을 좋아한다.",
  },
  {
    code: "R",
    question: "교복보다 체육복이 편하다.",
  },
  {
    code: "I",
    question:
      "친구들과 수다를 떠는 것보다 지식에 관해 이야기하는 것이 더 좋다.",
  },
  {
    code: "S",
    question: "내가 해야 할 일보다 친구들과의 관계가 더 중요하다.",
  },
  {
    code: "E",
    question: "승부욕이 강해서 꼭 이기고 싶어하는 마음이 있다.",
  },
  {
    code: "A",
    question: "나의 예술적, 창의적 재능을 표현할 수 있는 직업을 갖고 싶다.",
  },
  {
    code: "C",
    question: "안정적으로 오래 다닐 수 있는 일을 하고 싶다.",
  },
  {
    code: "R",
    question: "친구들과 이야기할 때 눈을 잘 안보는 편이다.",
  },
  {
    code: "A",
    question: "만화나 그림을 잘 그리는 편이다.",
  },
  {
    code: "E",
    question: "어려운 일이 생겨도 해결방법을 찾아 잘 이겨내는 편이다.",
  },
  {
    code: "S",
    question: "친구가 부탁을 하면 거절하는 것이 어렵다.",
  },
  {
    code: "I",
    question: "어떤 주제에 대해 정당한 체계를 갖고 분석하는 것을 좋아한다.",
  },
  {
    code: "C",
    question: "내가 세운 계획에 따라 행동하는 것이 좋다.",
  },
  {
    code: "R",
    question: "추상적인 내용은 흥미가 생기지 않는다.",
  },
  {
    code: "S",
    question: "대화를 할 때, 친구의 말에 공감을 잘 하는 편이다.",
  },
  {
    code: "C",
    question: "규칙적으로 생활하는 편이다.",
  },
  {
    code: "I",
    question: "나의 성격은 너그럽기보단 정확하고 합리적인 편이다.",
  },
  {
    code: "A",
    question: "예술과 관련한 분야에 소질이 있다.",
  },
  {
    code: "E",
    question: "새로운 것에 도전하는 것을 좋아한다.",
  },
  {
    code: "R",
    question: "스스로 감정을 잘 다스리는 편이다.",
  },
  {
    code: "I",
    question: "어떤 문제에 대해 원인을 먼저 분석하려고 한다.",
  },
  {
    code: "C",
    question: "책임감을 가지고 맡은 일을 수행하는 편이다.",
  },
  {
    code: "E",
    question: "친구들을 잘 이끄는 리더십을 가지고 있다.",
  },
  {
    code: "A",
    question: "감정표현이 풍부하고 작은 일에도 쉽게 감동한다.",
  },
  {
    code: "S",
    question: "봉사활동에 관심이 많은 편이다.",
  },
];

export const results = [
  {
    code: "R",
    name: "현실형",
    enName: "Realistic",
    summary: "솔직하고 원칙적인 전략가",
    desc:
      "기계, 농경과 같은 기술적 능력으로 돈, 권력 등의 가치를 고집하는 유형입니다. 혼자 일하는 것과 규칙적이고 명확한 일을 선호하며, 이상보다는 현실에 집중하는 경향이 있습니다. 사회적인 영향력을 발휘하는 일에는 어려움을 느끼지만, 자기통제력이 뛰어나고 문제 상황에서 명확한 방법을 찾아내는 능력이 있습니다. 정해진 규칙을 어기지 않고 물질적인 것을 다루는 데 뛰어난 재능을 가지고 있어 직장에서 성실하고 능력 있는 사람으로 인정받으며, 특히 경찰관, 소방관, 운동선수와 같은 직종에서 뛰어난 성과를 발휘합니다. 그러나 완고하고 냉정한 사람으로 비칠 수 있어 융통성을 발휘하는 자세가 필요합니다. ",
  },
  {
    code: "S",
    name: "사회형",
    enName: "Social",
    summary: "외향적이며 재치있는 동반자",
    desc:
      "따뜻한 심성과 타고난 공감 능력으로 사회적 맥락에서 문제를 해결하는 가장 사교적인 유형입니다. 감정적인 교류를 중요하게 생각하기에 불특정 다수에게 긍정적인 영향을 주기 위해 노력합니다. 타인에 대해 지원을 아끼지 않는 활발한 성격을 가지고 있기에 특히 교육과 봉사 분야에서 뛰어난 역량을 발휘하며, 교사나 성직자와 같은 직종에서 많이 활동하기도 합니다. 그러나 타인의 평가에 민감하여 쉽게 상처받는 예민한 성격은 사회형 사람들의 에너지를 빠르게 소모하므로 자기중심적인 태도를 기르는 것이 필요합니다.",
  },
  {
    code: "E",
    name: "진취형",
    enName: "Enterprising",
    summary: "외향적이고 자신감 있는 지도자",
    desc:
      "타고난 대인관계 능력과 언어구사력을 통해 경제적인 이익과 함께 권력을 쟁취하는 유형입니다. 자신의 리더십을 발휘할 수 있는 환경에서 타인을 통제하고 관리하는 것에 흥미를 느끼며, 리더십뿐만 아니라 자신이 기획한 것을 실행시키는 데 탁월한 능력을 갖추고 있습니다. 사회적 지위나 경제적 이익에 집착하는 경향이 있으며, 기업을 운영하는 CEO나 보험판매와 같은 직종에서 높은 성과를 기록하기도 합니다. 그러나 과학적이고 체계적인 활동에서는 능력이 다소 부족할 수 있기에 세밀한 일 처리를 위해서 분석하는 능력을 키워야 합니다.",
  },
  {
    code: "C",
    name: "관습형",
    enName: "Conventional",
    summary: "빈틈없고 효율적인 능력자",
    desc:
      "사무적이고 수학적인 능력을 통해 체계적인 조직 안에서 안정성을 추구하는 보수적인 유형입니다. 규칙을 따르는 일을 좋아하므로 문제 상황에서 새로운 정보를 받아들여 해결하기보다는 기존의 관례를 따라 해결 계획을 세우는 편입니다. 세부적인 것을 완성해 나가는 과정에서 재미와 성취감을 느끼기에 특히 재정, 경제와 관련된 분야에서 뛰어난 성과를 발휘하며, 은행원이나 비서, 공무원과 같은 직업을 선호합니다. 집단 내에서 정확하고 세밀한 일 처리로 인정받지만, 특유의 경직된 사고방식으로 고집이 세고 융통성 없는 사람으로 보일 수 있어 주의해야 합니다.",
  },
  {
    code: "I",
    name: "탐구형",
    enName: "Investigative",
    summary: "지적이고 독립적인 탐구자",
    desc:
      "학문과 지식에 관한 관심과 열정을 가진 유형으로 과학적, 탐구적 활동을 추구합니다. 물리학적, 생물학적 현상이나 문화적 현상에 관해 호기심을 가지고 관찰하는 것을 즐기며, 객관적인 정보를 수집하고 자료를 분석하는 과정을 선호합니다. 비교적 높은 자존심을 가지고 있어 스스로 만족할 때까지 한 주제를 깊이 있게 탐구하는데, 특히 과학과 수학에서 뛰어난 평가를 받으며 물리학자나 수학자, 컴퓨터 프로그래머와 같은 직종에서 높은 성과를 기록하기도 합니다. 그러나 감정 및 환경 변화에 둔감한 편인 탐구형은 타인과 소통 능력이 떨어질 수 있기에 소극적이고 비판적인 사람으로 보일 수 있어 사회적 관계 형성을 위해 노력해야 합니다.",
  },
  {
    code: "A",
    name: "예술형",
    enName: "Artistic",
    summary: "자유분방하고 독창적인 예술가",
    desc:
      "타고난 예술적 능력과 개방적인 사고방식을 통해 자유롭고 심미적인 활동을 추구하는 유형입니다. 상상력을 발휘할 수 있는 과제를 좋아하며 연기력과 언어구사력이 뛰어나 음악, 미술, 글쓰기와 같은 활동에 강합니다. 이들은 사회적 지위나 경제적 이익보다는 현재의 행복에 집중하는 경향이 있으며, 사회에 순응하지 않고 일상적인 것을 새롭게 표현하는 예술가, 음악가, 디자이너와 같은 직종에서 뛰어난 기질을 보입니다. 자신의 예술적 직감에 의존하여 문제를 해결하려는 경향이 있기에 타인에게 충동적이며 민감한 사람으로 비칠 수 있지만, 자신에게 관대한 만큼 타인에게도 개방적이며 평등을 중요시하는 성향을 가지고 있습니다.",
  },
];
